# Tap third party repositories
tap "goles/battery"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/core"
tap "mongodb/brew"

# Install core dependencies
brew "awscli"
brew "bash-completion"
brew "bat"
brew "bats-core"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "dockutil"
brew "duti"
brew "fasd"
brew "ffmpeg"
brew "gnu-sed"
brew "goles/battery/battery"
brew "graphviz"
brew "grep"
brew "grip"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lynx"
brew "mackup"
brew "MonitorControl"
brew "nano"
brew "pandoc"
brew "peco"
brew "psgrep"
brew "pyenv"
brew "python"
brew "rbenv"
brew "shellcheck"
brew "ssh-copy-id"
brew "stow"
brew "thefuck"
brew "tree"
brew "wget"

# Install developer specific dependencies
brew "bazel"
brew "croc"
brew "doxygen"
brew "gdb"
brew "git-filter-repo"
brew "git-town"
brew "heroku"
brew "miniconda"
brew "mongocli"
brew "mongodb-community"
brew "mongodb-community-shell"
brew "mongodb-database-tools"
brew "platformio"
brew "poetry"
brew "protobuf"
brew "redis"
